//-------------------------------------------------------------------
//キャラクタ汎用スーパークラス
//-------------------------------------------------------------------
#include "BChara.h"
#include "MyPG.h"
#include "Task_Shot.h"

//-------------------------------------------------------------------
//画面外に出たら消す処理
//敵は画面四方100ドット分の猶予を持って出現するため、
//上下左右に100ドット足した値を基準とする
void BChara::ScreenOutObj()
{
	if (pos.x < -16.f - 200.f || float(ge->screen2DWidth + 200) + 16.f < pos.x ||
		pos.y < -16.f - 200.f || float(ge->screen2DHeight + 200) + 16.f < pos.y)
		Kill();
}